POSTGRESQL

You are given two tables, phonees and calls. 

Eaach row of the tabe phones contains information about a client: name(name) and phone number (phone_number). Each client has only 1 phone number.
Each row of the table calls contains information about a single call, phone number of the caller, phone number of the callee and duration of the call in minutes.
Write an SQL query that finds all clients who talked for at least 5 minutes in total.

In [41]:
import pandas as pd
import sqlite3
from pandas.io import sql # reads sql statement and selects data from database

import os # find the pathway faster
os.getcwd()

'C:\\Users\\Para Raja Singham\\Documents\\DATA INSTITUTE\\SQL ASSESSMENT'

In [42]:
phone_table = pd.read_csv("PHONES - PHONES.csv") # import csv files and use tab to make it easier
phone_table
call_table = pd.read_csv("CALLS - CALLS.csv")
call_table

   ID  CALLER  CALLEE  DURATION
0  25    1234    7582         8
1   7    9999    7582         1
2  18    9999    3333         4
3   2    7582    3333         3
4   3    3333    1234         1
5  21    3333    1234         1

In [43]:
phone_table.head()

   Name  Phone_Number
0  Jack          1234
1  Lena          3333
2  Mark          9999
3  Anna          7582

In [44]:
db_sql = sqlite3.connect('sql_assessment.db.sqlite') #creating empty sql database

phone_table.to_sql('PHONE', con = db_sql, if_exists = 'replace', index = False) #we are converting the dataframe into a sql database, con means connecting to the dataframe and replacing it, index means dropping 1,2,3 etc. first column
call_table.to_sql('CALL', con = db_sql, if_exists = 'replace', index = False) # when we run this, a database is created in the folder

In [45]:
query = """ 
        SELECT NAME, SUM (TOTAL_DURATION_CALLEE + TOTAL_DURATION_CALLER) AS OVERALL_DURATION
        FROM PHONE
        INNER JOIN 

(SELECT CALLER, CALLEE, TOTAL_DURATION_CALLEE,TOTAL_DURATION_CALLER    
        
FROM               (SELECT CALLEE, SUM(DURATION) AS TOTAL_DURATION_CALLEE
                   FROM CALL
                   GROUP BY CALLEE
                   ORDER BY CALLEE
                   ) p
        
JOIN               (SELECT CALLER, SUM(DURATION) AS TOTAL_DURATION_CALLER
                   FROM CALL
                   GROUP BY CALLER
                   ORDER BY CALLER
                   ) q
        
ON  p.CALLEE = q.CALLER) z   

ON PHONE.Phone_Number = z.CALLER
GROUP BY NAME 
HAVING OVERALL_DURATION > 5

        """
ONLY_CALL = sql.read_sql(query, con=db_sql)
ONLY_CALL
# the triple quotes is a multiple line string # CREATE CALLER AND CALLEE DURATION. THEN ADD THE DURATION TGT. LEFT JOIN ON ADDED TABLE TO PUT THE NAMES TO RANK NAMES IN DURATION.

   Name  OVERALL_DURATION
0  Anna                12
1  Jack                10
2  Lena                 9